stapelberg/ChibiOS-Contrib/demos/MIMXRT1062/RT-TEENSY4_1/main.c
/*
    ChibiOS - Copyright (C) 2006..2015 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

#include "ch.h"
#include "hal.h"
#include "ch_test.h"
#include "rt_test_root.h"
#include "oslib_test_root.h"
#include "chprintf.h"
#include "shell.h"
#include <string.h>

#include "usbcfg.h"

/*
 * LED blinker thread.
 */
static THD_WORKING_AREA(waThread1, 64);
static THD_FUNCTION(Thread1, arg) {
    (void)arg;
    chRegSetThreadName("LEDBlinker");
    while (true) {
        palTogglePad(TEENSY_PIN13_IOPORT, TEENSY_PIN13);
        chThdSleepSeconds(1);
    }
}

extern void printf_debug(const char *format, ...);

#define SHELL_WA_SIZE THD_WORKING_AREA_SIZE(2048)

static const ShellCommand commands[] = {{NULL, NULL}};

static const ShellConfig shell_cfg1 = {
  (BaseSequentialStream *)&SDU1,
  commands
};

char buf[1024];

#include "fsl_lpuart.h"
void printf_debug(const char *format, ...)
{
  va_list args;
  va_start(args, format);
  int n = chvsnprintf(buf, sizeof(buf), format, args);
  // Directly write to serial instead of using SD4 BaseSequentialStream, because
  // the latter does not work from within a locked section (e.g. usbStart grabs
  // a lock).
  buf[n] = '\r';
  buf[n+1] = '\n';
  buf[n+2] = '\0';
  LPUART_WriteBlocking(LPUART1, (unsigned char*)buf, n+2);
  va_end(args);
}



/*
 * Application entry point.
 */
int main(void) {
    /*
     * System initializations.
     * - HAL initialization, this also initializes the configured device drivers
     *   and performs the board-specific initializations.
     * - Kernel initialization, the main() function becomes a thread and the
     *   RTOS is active.
     */
    halInit();
    chSysInit();

    const SerialConfig sc = {
      .sc_speed = 115200,
    };
    sdStart(&SD1, &sc);

    chprintf((BaseSequentialStream*)&SD1, "ChibiOS teensy 4.1 demo on the SD1 serial! updated :D\r\n");

    // printf_debug("chSysInit done\n");
    // printf_debug("IRQn = %d\n", MIMXRT1062_SERIAL3_IRQ_VECTOR);

#define MYSERIAL &SD1
    //#define MYSERIAL &SD1

    /*
     * Activates serial 1 (UART0) using the driver default configuration.
     */
    sdStart(MYSERIAL, NULL);
    sdWrite(MYSERIAL, (unsigned char *)"Hello world!\r\n", strlen("Hello world!\r\n"));

    /*
     * Creates the blinker thread.
     */
    chThdCreateStatic(waThread1, sizeof(waThread1), NORMALPRIO, Thread1, NULL);

#define USE_SHELL 1
#if USE_SHELL /* USB serial */
    /*
     * Initializes a serial-over-USB CDC driver.
     */
    sduObjectInit(&SDU1);
    sduStart(&SDU1, &serusbcfg);

    /*
     * Activates the USB driver and then the USB bus pull-up on D+.
     * Note, a delay is inserted in order to not have to disconnect the cable
     * after a reset.
     */
    usbDisconnectBus(serusbcfg.usbp);
    chThdSleepMilliseconds(1500);
    usbStart(serusbcfg.usbp, &usbcfg);
    usbConnectBus(serusbcfg.usbp);
#else
    // Better to disable to make serial debug available without interruption:

    test_execute((BaseSequentialStream *)MYSERIAL, &rt_test_suite);
    test_execute((BaseSequentialStream *)MYSERIAL, &oslib_test_suite);
#endif

    while (true) {
#if USE_SHELL
        if (SDU1.config->usbp->state == USB_ACTIVE) {
            sdWrite(MYSERIAL, (unsigned char *)"starting shl\r\n", strlen("starting shl\r\n"));
            thread_t *shelltp = chThdCreateFromHeap(NULL, SHELL_WA_SIZE, "shell", NORMALPRIO + 1, shellThread, (void *)&shell_cfg1);
            chThdWait(shelltp); /* Waiting termination.             */
        }
#endif
        chThdSleepSeconds(1);
    }

#if 0
  while (true) {
      	  GPIO7->DR_SET = (1<<3); // digitalWrite(13, HIGH);
      //palTogglePad(TEENSY_PIN13_IOPORT, TEENSY_PIN13);
	  systime_t before = chVTGetSystemTimeX();
	  delay(600000000); // 1s
	  systime_t after = chVTGetSystemTimeX();
	  //printf_debug("systicks = %d\n", after-before);
	  chThdSleepSeconds(1);
	  GPIO7->DR_CLEAR = (1<<3); // digitalWrite(13, LOW);      
	  chThdSleepSeconds(1);
	  //delay(600000000); // 1s
      //chThdSleepMilliseconds(1000);
  }
#endif
    return 0;
}
